Merge pull request #252 from cmudco/dev
Dev
